app/controllers/activities_controller.rb

  def schedule
    activity_key = params.keys.detect{|k| k =~ /^activity/}
    params[activity_key]['employee_ids'] ||= []
    @activity.update_attributes!(params[activity_key])
---
UPDATE `activities` SET `updated_at` = '2010-03-13 05:36:24', `scheduled_for` = '2010-04-01 12:00:00' WHERE `id` = 14

  def set_activity
    @activity = Activity.find(params[:id])
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1) AND ( (`activities`.`type` = 'Activity::Received' ) )