app/controllers/feedbacks_controller.rb

  def create
    @feedback = Feedback.new(params[:feedback])
    @feedback.save!
---
INSERT INTO `feedbacks` (`created_at`, `body`, `updated_at`, `activity_id`, `employee_id`, `score`, `recruit_id`) VALUES('2010-03-13 02:28:16', 'This dude is awesome', '2010-03-13 02:28:16', 1, 1, 2.0, 2)