app/controllers/recruits_controller.rb

  def index
    @recruits = Recruit.all
---
SELECT * FROM `recruits`

  def create
    @recruit = Recruit.new(params[:recruit])

    respond_to do |format|
      if @recruit.save
---
INSERT INTO `recruits` (`name`, `referrer`, `created_at`, `updated_at`, `phone`, `email`, `how_found`) VALUES('Chris', 'Kristjan', '2010-03-13 02:08:26', '2010-03-13 02:08:26', '12354', 'chris@causes.com', 'Drunk')

  def advance
    activity = Activity.from_param(params[:activity])
    activity.create!(:recruit => @recruit)
---
INSERT INTO `activities` (`completed_at`, `created_at`, `scheduled_for`, `updated_at`, `creator_id`, `type`, `recruit_id`) VALUES(NULL, '2010-03-13 04:39:24', NULL, '2010-03-13 04:39:24', NULL, 'Activity::PhoneIntro', NULL)

  def reject
    Activity::Rejected.create!(
      :recruit => @recruit,
      :completed_at => Time.now)
---
INSERT INTO `activities` (`completed_at`, `created_at`, `scheduled_for`, `updated_at`, `creator_id`, `type`, `recruit_id`) VALUES('2010-03-13 05:54:28', '2010-03-13 05:54:28', NULL, '2010-03-13 05:54:28', NULL, 'Activity::Rejected', 2)

  def decline
    Activity::Declined.create!(
      :recruit => @recruit,
      :completed_at => Time.now)
---
INSERT INTO `activities` (`completed_at`, `created_at`, `scheduled_for`, `updated_at`, `creator_id`, `type`, `recruit_id`) VALUES('2010-03-13 05:54:55', '2010-03-13 05:54:55', NULL, '2010-03-13 05:54:55', NULL, 'Activity::Declined', 2)

  def set_recruit
    @recruit = Recruit.find(params[:id])
---
SELECT * FROM `recruits` WHERE (`recruits`.`id` = 2)